# System utilities only (languages managed by mise)
brew "ast-grep"
brew "bat"
brew "bat-extras"
brew "btop"
brew "coreutils"
brew "curl"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "glow"
brew "gnu-tar"
brew "gs"
brew "imagemagick"
brew "jq"
brew "lazygit"
brew "less"
brew "lynx"
brew "neovim"
brew "openssl@3"
brew "pipx"
brew "ripgrep"
brew "shellcheck"
brew "tmux"
brew "tree"
brew "urlview"
brew "unzip"
brew "wget"
brew "yq"

# Runtime/version manager
brew "mise"

# Optional (macOS): fonts/apps you like
# cask "font-meslo-lg-nerd-font"
# cask "iterm2"
cask "alacritty"
