# System utilities only (languages managed by mise)
brew "git"
brew "neovim"
brew "tmux"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "eza"
brew "bat"
brew "gh"
brew "lazygit"
brew "jq"
brew "yq"
brew "wget"
brew "curl"
brew "openssl@3"
brew "unzip"
brew "gnu-tar"
brew "pipx"
brew "shellcheck"

# Runtime/version manager
brew "mise"

# Optional (macOS): fonts/apps you like
# cask "font-meslo-lg-nerd-font"
# cask "iterm2"
