aws-shell
awscli
azure-cli
base64
bat
coreutils
figlet
fzf
git
gnupg
go
gotop
jq
kubernetes-cli
macvim
neovim
nvm
perl
plantuml
ripgrep
terragrunt
tmux
